<a href="https://colab.research.google.com/github/Nckflannery/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/module1-join-and-reshape-data/LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [3]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-09-09 22:40:47--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.205.61
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.205.61|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.3’

instacart_online_gr 100%[===================>] 196.03M  88.2MB/s    in 2.2s

2019-09-09 22:40:49 (88.2 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.3’ saved [205548478/205548478]

In [4]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [5]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

##Loading data and looking at data

In [0]:
# Create dataframes from the csv's
# AND IMPORT PANDAS

import pandas as pd
aisles = pd.read_csv('aisles.csv')
departments = pd.read_csv('departments.csv')
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')
orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')

In [6]:
# Look at aisles
aisles.head()

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [7]:
# Look at departments
departments.head()

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [20]:
# Look at order_products__prior
order_products__prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [21]:
# Look at order_products__train
order_products__train.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [15]:
# Look at orders
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [34]:
# Look at products
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

##Which columns we will need and which dataframes have them

We will need product_name and order_id so we will need dataframes:

* products
* orders

However, orders data frame doesn't have product_id so we will also need:
* order_products__prior
* order_products__train

We will need to merge order_products__prior and order_products__train

In [0]:
# First let's combine order_products__prior and order_products__train
# using pd.concat
order_products = pd.concat([order_products__prior, order_products__train])

In [0]:
# Use assert to check that rows merged correctly
assert order_products__prior.shape[0] + order_products__train.shape[0] == order_products.shape[0]

In [0]:
# Columns we need from order_products are order_id and product_id
OP = order_products[['order_id', 'product_id']]

In [0]:
# Column we need from orders is order_id
# order = orders[['order_id']]

###THIS STEP WAS NOT NEEDED

In [0]:
# Columns we need from products are product_id and product_name
# We can also take this a step further since we know which product names we want
condition = (
    products['product_name'] == 'Banana')|(
    products['product_name'] == 'Bag of Organic Bananas')|(
    products['product_name'] == 'Organic Strawberries') |(
    products['product_name'] == 'Organic Baby Spinach') |(
    products['product_name'] == 'Organic Hass Avocado') |(
    products['product_name'] == 'Organic Avocado') |(
    products['product_name'] == 'Large Lemon') |(
    products['product_name'] == 'Strawberries') |(
    products['product_name'] == 'Limes') |(
    products['product_name'] == 'Organic Whole Milk')

columns_products = ['product_id', 'product_name']

In [0]:
prod = products.loc[condition, columns_products]

In [49]:
OP.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [69]:
#order.head()

###THIS STEP WAS NOT NEEDED

   order_id
0   2539329
1   2398795
2    473747
3   2254736
4    431534

In [83]:
prod.head(10)

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21136       21137    Organic Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana
26208       26209                   Limes
27844       27845      Organic Whole Milk
47208       47209    Organic Hass Avocado
47625       47626             Large Lemon
47765       47766         Organic Avocado

## Start merging and working towards the answer to the question

In [0]:
# Merge order_produce with prod
prod_OP = pd.merge(OP, prod, how='inner', on='product_id')

In [110]:
prod_OP

         order_id  product_id          product_name
0               3       21903  Organic Baby Spinach
1              26       21903  Organic Baby Spinach
2              31       21903  Organic Baby Spinach
3              39       21903  Organic Baby Spinach
4              56       21903  Organic Baby Spinach
5              57       21903  Organic Baby Spinach
6              73       21903  Organic Baby Spinach
7              92       21903  Organic Baby Spinach
8             113       21903  Organic Baby Spinach
9             135       21903  Organic Baby Spinach
10            139       21903  Organic Baby Spinach
11            148       21903  Organic Baby Spinach
12            169       21903  Organic Baby Spinach
13            177       21903  Organic Baby Spinach
14            190       21903  Organic Baby Spinach
15            213       21903  Organic Baby Spinach
16            219       21903  Organic Baby Spinach
17            222       21903  Organic Baby Spinach
18            239       21903  Organic Baby Spinach
19            248       21903  Organic Baby Spinach
20            251       21903  Organic Baby Spinach
21            277       21903  Organic Baby Spinach
22            279       21903  Organic Baby Spinach
23            281       21903  Organic Baby Spinach
24            300       21903  Organic Baby Spinach
25            337       21903  Organic Baby Spinach
26            347       21903  Organic Baby Spinach
27            359       21903  Organic Baby Spinach
28            364       21903  Organic Baby Spinach
29            371       21903  Organic Baby Spinach
...           ...         ...                   ...
2418284   3405699       26209                 Limes
2418285   3405880       26209                 Limes
2418286   3406078       26209                 Limes
2418287   3406399       26209                 Limes
2418288   3406484       26209                 Limes
2418289   3406980       26209                 Limes
2418290   3408265       26209                 Limes
2418291   3408434       26209                 Limes
2418292   3408829       26209                 Limes
2418293   3409528       26209                 Limes
2418294   3409559       26209                 Limes
2418295   3409809       26209                 Limes
2418296   3410565       26209                 Limes
2418297   3410612       26209                 Limes
2418298   3411185       26209                 Limes
2418299   3411480       26209                 Limes
2418300   3411943       26209                 Limes
2418301   3412497       26209                 Limes
2418302   3412813       26209                 Limes
2418303   3413466       26209                 Limes
2418304   3414010       26209                 Limes
2418305   3415982       26209                 Limes
2418306   3417341       26209                 Limes
2418307   3418665       26209                 Limes
2418308   3418754       26209                 Limes
2418309   3418861       26209                 Limes
2418310   3418905       26209                 Limes
2418311   3419642       26209                 Limes
2418312   3420257       26209                 Limes
2418313   3420286       26209                 Limes

[2418314 rows x 3 columns]

In [0]:
# Merge to create our final list including order_id, product_id and product_name
#final = pd.merge(order, prod_OP, how='inner', on='order_id')

#####THIS STEP WAS NOT NEEDED

In [0]:
#final

In [0]:
# Use value_counts to check amount of times ordered per item
# Use rename_axis and reset_index(name=) to put list into a new dataframe

###amounts = final['product_id'].value_counts().rename_axis('product_id').reset_index(name='Times Ordered')
amounts = prod_OP['product_id'].value_counts().rename_axis('product_id').reset_index(name='Times Ordered')

In [171]:
amounts

   product_id  Times Ordered
0       24852         491291
1       13176         394930
2       21137         275577
3       21903         251705
4       47209         220877
5       47766         184224
6       47626         160792
7       16797         149445
8       26209         146660
9       27845         142813

In [0]:
# Let's merge with prod to get product names
amount_merge = pd.merge(prod, amounts, how='inner', on='product_id')

In [173]:
amount_merge

   product_id            product_name  Times Ordered
0       13176  Bag of Organic Bananas         394930
1       16797            Strawberries         149445
2       21137    Organic Strawberries         275577
3       21903    Organic Baby Spinach         251705
4       24852                  Banana         491291
5       26209                   Limes         146660
6       27845      Organic Whole Milk         142813
7       47209    Organic Hass Avocado         220877
8       47626             Large Lemon         160792
9       47766         Organic Avocado         184224

## Final Table

In [169]:
# Let's make it look a little nicer
amount_merge.columns = [i.replace('_', ' ') for i in amount_merge]
final = amount_merge.sort_values(by='Times Ordered', ascending=False)
final.style.hide_index()

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

##Replicate Code

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [133]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [134]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

###Table1 --> Tidy

In [135]:
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [136]:
tidy = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [137]:
tidy = tidy.rename(columns={
    'index': 'name', 
    'variable': 'trt', 
    'value': 'result'
})

tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [138]:
tidy.trt = tidy.trt.str.replace('treatment', '')
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

###Tidy --> Table1

In [0]:
tidy_pivot = tidy.pivot_table(index='name', columns='trt', values='result')

In [140]:
tidy_pivot

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

##Table2 --> Tidy

so we want:
* Each variable is a column
* Each observation is a row

In [0]:
# Reset index to give us an index
table2 = table2.reset_index()

In [143]:
# Look at table
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [0]:
tidy2 = table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])

In [149]:
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [0]:
# Clean up tidy2 column names
tidy2 = tidy2.rename(columns={
    'index':'Treatment Type',
    'variable':'Name',
    'value':'Result'
})
# Clean up 'treatment' from treatment type
tidy2['Treatment Type'] = tidy2['Treatment Type'].str.replace('treatment','')

In [157]:
tidy2

  Treatment Type          Name  Result
0              a    John Smith     NaN
1              b    John Smith     2.0
2              a      Jane Doe    16.0
3              b      Jane Doe    11.0
4              a  Mary Johnson     3.0
5              b  Mary Johnson     1.0

##Tidy2 --> Table2

In [0]:
tidy2_pivot = tidy2.pivot_table(index='Treatment Type', columns='Name', values='Result')

In [159]:
tidy2_pivot

Name            Jane Doe  John Smith  Mary Johnson
Treatment Type
a                   16.0         NaN           3.0
b                   11.0         2.0           1.0

##Seaborn Flights Assignment

In [0]:
flights = sns.load_dataset('flights')

In [162]:
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
5    1949       June         135
6    1949       July         148
7    1949     August         148
8    1949  September         136
9    1949    October         119
10   1949   November         104
11   1949   December         118
12   1950    January         115
13   1950   February         126
14   1950      March         141
15   1950      April         135
16   1950        May         125
17   1950       June         149
18   1950       July         170
19   1950     August         170
20   1950  September         158
21   1950    October         133
22   1950   November         114
23   1950   December         140
24   1951    January         145
25   1951   February         150
26   1951      March         178
27   1951      April         163
28   1951        May         172
29   1951       June         178
..    ...        ...         ...
114  1958       July         491
115  1958     August         505
116  1958  September         404
117  1958    October         359
118  1958   November         310
119  1958   December         337
120  1959    January         360
121  1959   February         342
122  1959      March         406
123  1959      April         396
124  1959        May         420
125  1959       June         472
126  1959       July         548
127  1959     August         559
128  1959  September         463
129  1959    October         407
130  1959   November         362
131  1959   December         405
132  1960    January         417
133  1960   February         391
134  1960      March         419
135  1960      April         461
136  1960        May         472
137  1960       June         535
138  1960       July         622
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

Create a pivot table showing the number of passengers by month and year

In [0]:
flights_pivot = flights.pivot_table(index='year', columns='month', values='passengers')

In [164]:
flights_pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
import pandas as pd

products1 = pd.read_csv('products.csv')

order_products1 = pd.concat([pd.read_csv('order_products__prior.csv'), 
                            pd.read_csv('order_products__train.csv')])

orders1 = pd.read_csv('orders.csv')

In [0]:
products1.head()

In [0]:
order_products1.head()

In [0]:
orders1.head()

Reproduce the list of the top 25 LATEST ordered popular (popular = >2,900 orders) products

For this challenge we will first need to create a list of the most popular products, which means we need some of the same info from the assignment.

To start, we will need info from the columns:
* order_hour_of_day
* order_id
* product_id
* product_name

In [0]:
# Let's start by trimming our dataframes
trim_ord = orders1[['order_id', 'order_hour_of_day']]
trim_OP = order_products1[['order_id', 'product_id']]
trim_prod = products1[['product_id', 'product_name']]

##Trying to sort data using conditions instead

In [0]:
# Merge trim_OP and trim_prod to get list of most popular items
OP_prod = pd.merge(trim_OP, trim_prod, how='inner', on='product_id')

In [0]:
# Big merge of all pertinent data
merged = (trim_ord.merge(trim_OP).merge(trim_prod))

In [0]:
# Only look at orders after 12pm
condition = merged['order_hour_of_day'] > 12
merged_trimmed = merged[condition]

In [0]:
# Create sorted list to find popular items
popular = merged_trimmed['product_id'].value_counts().rename_axis('product_id').reset_index(name='Times Ordered')

In [0]:
# Only look at items ordered more than 2900 times
condition_pop = popular['Times Ordered'] >= 2900
popular_late = popular[condition_pop]

In [0]:
final_pop_late = pd.merge(popular_late, trim_prod, how='inner', on='product_id')

In [26]:
final_pop_late.head(25)

    product_id  Times Ordered              product_name
0        24852         275720                    Banana
1        13176         221476    Bag of Organic Bananas
2        21137         157296      Organic Strawberries
3        21903         143816      Organic Baby Spinach
4        47209         126847      Organic Hass Avocado
5        47766         106522           Organic Avocado
6        47626          90751               Large Lemon
7        26209          84053                     Limes
8        16797          82881              Strawberries
9        27845          80125        Organic Whole Milk
10       27966          79601       Organic Raspberries
11       22935          66821      Organic Yellow Onion
12       24964          65612            Organic Garlic
13       45007          62881          Organic Zucchini
14       39275          59432       Organic Blueberries
15       49683          57974            Cucumber Kirby
16        5876          52313             Organic Lemon
17       40706          51014    Organic Grape Tomatoes
18       28204          50205        Organic Fuji Apple
19       30391          49145          Organic Cucumber
20        8277          48111  Apple Honeycrisp Organic
21        4920          48068       Seedless Red Grapes
22       45066          46281          Honeycrisp Apple
23       42265          44692      Organic Baby Carrots
24        4605          44090             Yellow Onions

##NOT SURE WHY BUT STILL END UP WITH SAME ITEMS IN LIST AS ASSIGNMENT

##THIS WAS HOW I TRIED AT FIRST

In [0]:
# Merge trim_OP and trim_prod to get list of most popular items
OP_prod = pd.merge(trim_OP, trim_prod, how='inner', on='product_id')

In [0]:
# Create sorted list to find popular items
popular = OP_prod['product_id'].value_counts().rename_axis('product_id').reset_index(name='Times Ordered')

In [0]:
# Use only items with more than 2900 times ordered
popular_trimmed = popular[popular['Times Ordered'] >= 2900]

In [0]:
names_merge = pd.merge(popular_trimmed, trim_prod, how='inner', on='product_id')

In [0]:
order_merge = pd.merge(names_merge, trim_OP,  how='inner', on='product_id')

In [36]:
order_merge.head(20)

    product_id  Times Ordered product_name  order_id
0        24852         491291       Banana        10
1        24852         491291       Banana        20
2        24852         491291       Banana        22
3        24852         491291       Banana        26
4        24852         491291       Banana        52
5        24852         491291       Banana        53
6        24852         491291       Banana        54
7        24852         491291       Banana        72
8        24852         491291       Banana        80
9        24852         491291       Banana        88
10       24852         491291       Banana        92
11       24852         491291       Banana       110
12       24852         491291       Banana       130
13       24852         491291       Banana       143
14       24852         491291       Banana       158
15       24852         491291       Banana       174
16       24852         491291       Banana       175
17       24852         491291       Banana       177
18       24852         491291       Banana       181
19       24852         491291       Banana       184

In [0]:
# Merge all data
merged = pd.merge(order_merge, trim_ord, how='inner', on='order_id')

In [0]:
merged_latest = merged.sort_values(by='order_hour_of_day', ascending=True)

In [38]:
merged_latest.head(25)

          product_id  Times Ordered  ... order_id  order_hour_of_day
7407387        46906          40498  ...  2190304                  0
10679370       16797         149445  ...   536764                  0
10679369       21903         251705  ...   536764                  0
7435415        34969          56643  ...  2215437                  0
7435414         8518          70804  ...  2215437                  0
7435413        13176         394930  ...  2215437                  0
5682178        13176         394930  ...   670139                  0
5682179        28204          92889  ...   670139                  0
5682180         8277          87272  ...   670139                  0
5682181        25146          25972  ...   670139                  0
5682182        18027          18487  ...   670139                  0
10679371       28204          92889  ...   536764                  0
5682183        31040          17333  ...   670139                  0
5682185        39947          11755  ...   670139                  0
10679071       24518           3751  ...   535865                  0
10679070       48720           5602  ...   535865                  0
10679069       44643           5617  ...   535865                  0
10679068       38312           5906  ...   535865                  0
10679067       32740           5914  ...   535865                  0
10679066       38944           7423  ...   535865                  0
5682186        18594           8578  ...   670139                  0
5682187        39322           3743  ...   670139                  0
10679065        7969          11048  ...   535865                  0
5682184         2825          13756  ...   670139                  0
10679372        4605          76929  ...   536764                  0

[25 rows x 5 columns]

##IGNORE

In [0]:
conditions = (
    products1['product_name'] == 'Half Baked Frozen Yogurt')|(
    products1['product_name'] == 'The Tonight Dough Ice Cream')|(
    products1['product_name'] == 'Americone Dream Ice Cream') |(
    products1['product_name'] == 'Half Baked Ice Cream') |(
    products1['product_name'] == 'Phish Food Ice Cream') |(
    products1['product_name'] == 'Milk And Cookies Ice Cream') |(
    products1['product_name'] == 'Sicilian Pistachio') |(
    products1['product_name'] == 'Chocolate Peanut Butter Cup Gelato') |(
    products1['product_name'] == 'Birthday Cake Light Ice Cream') |(
    products1['product_name'] == 'Cherry Garcia Ice Cream') |(
    products1['product_name'] == 'Strawberry Ice Cream')|(
    products1['product_name'] == 'Vanilla Bean Light Ice Cream')|(
    products1['product_name'] == 'Coffee Ice Cream') |(
    products1['product_name'] == 'Roman Raspberry Sorbetto') |(
    products1['product_name'] == 'Mediterranean Mint Gelato') |(
    products1['product_name'] == 'Caramel Cookie Crunch Gelato') |(
    products1['product_name'] == 'Chocolate Chip Cookie Dough Ice Cream') |(
    products1['product_name'] == 'Mint Chip') |(
    products1['product_name'] == 'Coconut Almond Minis Frozen Dessert Bars') |(
    products1['product_name'] == 'Mint Chocolate Chip Ice Cream') |(
    products1['product_name'] == 'Chocolate Peanut Butter Ice Cream') |(
    products1['product_name'] == 'Vanilla Milk Chocolate Almond Ice Cream Bars') |(
    products1['product_name'] == 'Sea Salt Caramel Gelato') |(
    products1['product_name'] == 'Vanilla Bean Ice Cream') |(
    products1['product_name'] == 'Rising Crust Pepperoni Pizza')
columns_products = ['product_id', 'product_name']
trim_prod = products1.loc[conditions, columns_products]

When I ran with above code I found that many of these items were not ordered more than 2900 times

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####